In [ ]:
I. You are provided with the following raw data:

registration_number = np.random.randint(2100,7200,10)

students = Ann,Brian,Cate,Denis,Eva,Francis,Gary,Hellen,Ian,Jacqueline

subjects = English,Maths,Kiswahili,GHC,Science

Marks =

     English : 87, 89, 96, 96, 90, 89, 93, 89, 92, 95

     Maths: 89, 90, 86, 96, 94, 85, 93,88, 93, 95

     Kiswahili :92, 86, 88, 96, 85, 87, 87, 87, 94, 88

     GHC : 89, 88, 89, 90,89, 88, 92, 92, 95, 86

     Science :89, 87, 85, 94, 87, 86, 89, 91, 88, 94

a. Create a dataframe from the above raw data.

b. Display a summary of the basic statistics.
c. Create a program which upon entering the registration_number
   displays the results for the respective student.

In [194]:
#import relevant libraries
import pandas as pd
import numpy as np

In [68]:
registration_number = np.random.randint(2100,7200,10)
registration_number

array([2171, 5372, 3550, 4670, 6531, 4134, 3865, 6158, 4972, 2136])

In [195]:
Results= {'registration_number':[2171, 5372, 3550, 4670, 6531, 4134, 3865, 6158, 4972, 2136],
        'students' : ['Ann','Brian','Cate','Denis','Eva','Francis','Gary','Hellen','Ian','Jacqueline'],
        'English' : [87, 89, 96, 96, 90, 89, 93, 89, 92, 95],

         'Maths': [89, 90, 86, 96, 94, 85, 93,88, 93, 95],

         'Kiswahili' :[92, 86, 88, 96, 85, 87, 87, 87, 94, 88],

        'GHC' : [89, 88, 89, 90,89, 88, 92, 92, 95, 86],

        'Science' :[89, 87, 85, 94, 87, 86, 89, 91, 88, 94]}

In [196]:
type(Results)

dict

In [2]:
# a. Create a dataframe from the above raw data.

In [197]:
pd.DataFrame()
Results=pd.DataFrame(Results)
Results

   registration_number    students  English  Maths  Kiswahili  GHC  Science
0                 2171         Ann       87     89         92   89       89
1                 5372       Brian       89     90         86   88       87
2                 3550        Cate       96     86         88   89       85
3                 4670       Denis       96     96         96   90       94
4                 6531         Eva       90     94         85   89       87
5                 4134     Francis       89     85         87   88       86
6                 3865        Gary       93     93         87   92       89
7                 6158      Hellen       89     88         87   92       91
8                 4972         Ian       92     93         94   95       88
9                 2136  Jacqueline       95     95         88   86       94

In [198]:
#create a copy
df1=Results.copy()
df1

   registration_number    students  English  Maths  Kiswahili  GHC  Science
0                 2171         Ann       87     89         92   89       89
1                 5372       Brian       89     90         86   88       87
2                 3550        Cate       96     86         88   89       85
3                 4670       Denis       96     96         96   90       94
4                 6531         Eva       90     94         85   89       87
5                 4134     Francis       89     85         87   88       86
6                 3865        Gary       93     93         87   92       89
7                 6158      Hellen       89     88         87   92       91
8                 4972         Ian       92     93         94   95       88
9                 2136  Jacqueline       95     95         88   86       94

In [3]:
# b. Display a summary of the basic statistics.

In [199]:
df1.T

,0,1,2,3,4,5,6,7,8,9
registration_number,2171,5372,3550,4670,6531,4134,3865,6158,4972,2136
students,Ann,Brian,Cate,Denis,Eva,Francis,Gary,Hellen,Ian,Jacqueline
English,87,89,96,96,90,89,93,89,92,95
Maths,89,90,86,96,94,85,93,88,93,95
Kiswahili,92,86,88,96,85,87,87,87,94,88
GHC,89,88,89,90,89,88,92,92,95,86
Science,89,87,85,94,87,86,89,91,88,94

In [201]:
df1['Total']=df1['English']+df1['Maths']+ df1['Kiswahili']+ df1	['GHC']+ df1['Science']

In [222]:
df1

,students,English,Maths,Kiswahili,GHC,Science,Total
registration_number,,,,,,,
2171,Ann,87,89,92,89,89,446
5372,Brian,89,90,86,88,87,440
3550,Cate,96,86,88,89,85,444
4670,Denis,96,96,96,90,94,472
6531,Eva,90,94,85,89,87,445
4134,Francis,89,85,87,88,86,435
3865,Gary,93,93,87,92,89,454
6158,Hellen,89,88,87,92,91,447
4972,Ian,92,93,94,95,88,462
2136,Jacqueline,95,95,88,86,94,458

In [178]:
df1.iloc[0,1]

'Ann'

In [179]:
df1.iloc[9,6]

94

In [180]:
print(df1.iloc[9,6])

94

In [181]:
df1.iloc[9:,5]

9    86
Name: GHC, dtype: int64

In [203]:
df1.columns= df1.columns.str.strip()

In [204]:
df1=df1.set_index('registration_number')
df1

,students,English,Maths,Kiswahili,GHC,Science,Total
registration_number,,,,,,,
2171,Ann,87,89,92,89,89,446
5372,Brian,89,90,86,88,87,440
3550,Cate,96,86,88,89,85,444
4670,Denis,96,96,96,90,94,472
6531,Eva,90,94,85,89,87,445
4134,Francis,89,85,87,88,86,435
3865,Gary,93,93,87,92,89,454
6158,Hellen,89,88,87,92,91,447
4972,Ian,92,93,94,95,88,462
2136,Jacqueline,95,95,88,86,94,458

In [4]:
# c. Create a program which upon entering the registration_number displays the results for the respective student.

In [205]:
def Results():
    x = int(input("Enter Student's registration number : "))
    print(df1.loc[x])

In [163]:
Results()

Enter Student's registration number :  2171

students      Ann
English        87
Maths          89
Kiswahili      92
GHC            89
Science        89
Total         446
cumulative    446
Name: 2171, dtype: object

In [206]:
Results()

Enter Student's registration number :  5372

students     Brian
English         89
Maths           90
Kiswahili       86
GHC             88
Science         87
Total          440
Name: 5372, dtype: object

In [207]:
Results()

Enter Student's registration number :  3550

students     Cate
English        96
Maths          86
Kiswahili      88
GHC            89
Science        85
Total         444
Name: 3550, dtype: object

In [208]:
Results()

Enter Student's registration number :  4670

students     Denis
English         96
Maths           96
Kiswahili       96
GHC             90
Science         94
Total          472
Name: 4670, dtype: object

In [209]:
Results()

Enter Student's registration number :  6531

students     Eva
English       90
Maths         94
Kiswahili     85
GHC           89
Science       87
Total        445
Name: 6531, dtype: object

In [210]:
Results()

Enter Student's registration number :  4134

students     Francis
English           89
Maths             85
Kiswahili         87
GHC               88
Science           86
Total            435
Name: 4134, dtype: object

In [211]:
Results()

Enter Student's registration number :  3865

students     Gary
English        93
Maths          93
Kiswahili      87
GHC            92
Science        89
Total         454
Name: 3865, dtype: object

In [212]:
Results()

Enter Student's registration number :  6158

students     Hellen
English          89
Maths            88
Kiswahili        87
GHC              92
Science          91
Total           447
Name: 6158, dtype: object

In [213]:
Results()

Enter Student's registration number :  4972

students     Ian
English       92
Maths         93
Kiswahili     94
GHC           95
Science       88
Total        462
Name: 4972, dtype: object

In [214]:
Results()

Enter Student's registration number :  2136

students     Jacqueline
English              95
Maths                95
Kiswahili            88
GHC                  86
Science              94
Total               458
Name: 2136, dtype: object

Q 3.a. Create a program 'SIM Services' with the following options :

studtel services

studtel money

language

In [1]:
SIM_Services= {

        'studtel_services':['telcom','airtel','safcom'],
        'pin':[7777],
        'balance':[5000],
        'studtel_money': ['buy airtime','send money','make payments','withdraw money','bank','my account'],
        'language':['english''kiswahili']}

In [2]:
print('welcome to studtel_services')
languge=int(input('select language'))
print('Enter 1:English\n Enter 2: Kiswahili')
service=int(input('Enter pin'))
print('select studtel_money')
print('Enter 1:buy airtime\n Enter 2: send money\n Enter 3: make payments\n Enter 4: withdraw money\n Enter 5:bank\n Enter 6: my account')
query=int(input('Enter your selection'))
print('Enter amount to buy')
amount=int(input('enter amount'))
print('enter 3 to quit')

welcome to studtel_services

select language 1

Enter 1:English
 Enter 2: Kiswahili

Enter pin 7777

select studtel_money
Enter 1:buy airtime
 Enter 2: send money
 Enter 3: make payments
 Enter 4: withdraw money
 Enter 5:bank
 Enter 6: my account

Enter your selection 1

Enter amount to buy

enter amount 500

enter 3 to quit

    Q4

In [2]:
Students_Services= {
 'Sim_Service':['My_Number','My_Account' 'Report_Fraud','Block_SIM\Swap','Get_Postpaid','Mifi','Router','Get_PUK'],

'Studtel_Shop':['Nairobi','Central','Eastern','Western','Nyanza','Rift_Valley','Coast','North_Eastern','Main Menu'],
'Nairobi/Kiambu': ['Mombasa Rd/Uhuru Highway','CBD','Westlands','Karen/Rongai','Thika Road']}

<>:2: SyntaxWarning: invalid escape sequence '\S'
<>:2: SyntaxWarning: invalid escape sequence '\S'
C:\Users\pc\AppData\Local\Temp\ipykernel_8360\2833456858.py:2: SyntaxWarning: invalid escape sequence '\S'
  'Sim_Service':['My_Number','My_Account' 'Report_Fraud','Block_SIM\Swap','Get_Postpaid','Mifi','Router','Get_PUK'],

In [3]:
print('Welcome to Student_Services')
Student_Services=int(input('find Studtel_Shop'))
print('Enter 1:Nairobi\n Enter 2: Central\n Enter 3: Eastern\n Enter 4: Western\n Enter 5: Nyanza\n Enter 6: Rift_Valley\n Enter 7: Coast\n Enter 8: North_Eastern\n Enter 0: Main menu')
Shop=int(input('Choose a shop within NAIROBI,KIAMBU'))
print('Enter 1:Mombasa Rd/Uhuru Highway\n Enter 2: CBD\n Enter 3: Westlands\n Enter 4: Karen/Rongai\n Enter 5: Thika Road\n Enter 00: exit')
CBD=int(input('choose a shop in CBD'))
print('You will get an sms with the list of shops in CBD')

Welcome to Student_Services

find Studtel_Shop 5

Enter 1:Nairobi
 Enter 2: Central
 Enter 3: Eastern
 Enter 4: Western
 Enter 5: Nyanza
 Enter 6: Rift_Valley
 Enter 7: Coast
 Enter 8: North_Eastern
 Enter 0: Main menu

Choose a shop within NAIROBI,KIAMBU 1

Enter 1:Mombasa Rd/Uhuru Highway
 Enter 2: CBD
 Enter 3: Westlands
 Enter 4: Karen/Rongai
 Enter 5: Thika Road
 Enter 00: exit

choose a shop in CBD 2

You will get an sms with the list of shops in CBD